---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AssetPropertyTime
source: html/21aebbc8-278a-8970-47f4-c1572ac352a5.htm
---
# AssetPropertyTime Properties

Identifies if the object is read-only or modifiable.
 If true, the object may not be modified. If false, the object's contents may be modified.